{
  "26": {
    "id": 26,
    "updatedTs": 1670228830,
    "createdTs": 1670228552,
    "content": "#ChatGPT 真的太神奇了，什么都可以问。"
  },
  "27": {
    "id": 27,
    "updatedTs": 1670245525,
    "createdTs": 1670245525,
    "content": "This is my first memos, automatic public on my website. #memos "
  },
  "29": {
    "id": 29,
    "updatedTs": 1670769103,
    "createdTs": 1670750428,
    "content": "我好像已经是阳过了，但没发烧。只是特别想喝水，然后没什么精神，也不知道是流感还是新冠。Whatever~"
  },
  "30": {
    "id": 30,
    "updatedTs": 1670991775,
    "createdTs": 1670991775,
    "content": "This tool can help you do the Diagram as code for cloud system architectures.[mingrammer/diagrams](https://github.com/mingrammer/diagrams) "
  },
  "31": {
    "id": 31,
    "updatedTs": 1671430490,
    "createdTs": 1671430490,
    "content": "Building #meilisearch and #umami analytics systems on #flyio. Glad everything is running in the free tier."
  },
  "32": {
    "id": 32,
    "updatedTs": 1671430535,
    "createdTs": 1671430535,
    "content": "在#flyio 上构建了#meilisearch 和#umami 分析系统。这些都运行在免费额度中。"
  },
  "139": {
    "id": 139,
    "updatedTs": 1679320752,
    "createdTs": 1679320729,
    "content": "把博客用 #Astro 重建了，既有 #Memos 集成，又支持 #MDX ，还有好看的新样式，还可以很方便的静态化，构建速度比 #NextJS 快一点点，同时还能写 React 组件。就差多写一点博客文章了。"
  },
  "140": {
    "id": 140,
    "updatedTs": 1679320735,
    "createdTs": 1679320735,
    "content": "Use #Astro rebuild my blog system, now I build the lovely style, Integrate with #Memos, support SSG, build speed a little faster than #NextJS and it also support React components. Hope I can take more time on blog articles."
  },
  "143": {
    "id": 143,
    "updatedTs": 1679474697,
    "createdTs": 1679474687,
    "content": "[Refactor your blog comments system with Webmention.io](https://geekplux.com/posts/webmention)\nWelcome to [webmentions](https://eindex.me/posts/webmentions)."
  },
  "149": {
    "id": 149,
    "updatedTs": 1679561353,
    "createdTs": 1679561005,
    "content": "[Advices from a Software Engineer with 8 Years of Experience - DEV Community](https://dev.to/ruizb/advices-from-a-software-engineer-with-8-years-of-experience-2n0l)\n\nThis is very useful. I totally agree with what you said. I have seven years of working experience. In the beginning of my career, I worked for a small startup company for almost two years. During that time, I spent most of my time on hard skills, such as high IO tech and search optimization.\n\nAfter joining another company, I discovered that they don’t rely solely on hard technology skills. They have many conversion and discussion meetings that allow everyone to share context and avoid relying on a single person. This experience helped me develop my soft skills.\n\nI also love adventure, and my company provides a lot of opportunities to switch roles and get in touch with new domains and infrastructure. I have worked in many roles, such as Salesforce developer, back-end developer, data engineer, front-end developer, application security specialist, DevOps, and security code reviewer. Every time I switched to a new domain was a huge challenge, but it also made me stronger and gave me a lot of skills. I learned a lot from working with different people.\n\nOne thing that I learned from this article is the importance of a work log. I haven’t been keeping one for a long time, and that has resulted in me losing memory of some amazing output from a long time ago. Any scale cloud can help a person keep a work log. Additionally, I really hate performance reviews, but they are necessary to get a promotion or show output. Otherwise, your teammates may trust you, but any other person or leader in another team is unlikely to know what you are doing. As coincidence would have it, I decided to build a weekly newsletter to share what I see and what I am doing in public.\n\nThank you for sharing your insights."
  },
  "180": {
    "id": 180,
    "updatedTs": 1681367568,
    "createdTs": 1681367568,
    "content": "[In Praise of Top Down Programming](https://www.i-programmer.info/professional-programmer/i-programmer/3864-in-praise-of-top-down-.html)\nI like top down too, always using this method to problem solving and programming, that can easy start from 0 to 1, but it may leading to problem which not have any solution yet, but already put effort on above level, that will making a issue.\n\nSo my suctions are flow the top down design, found the MVP scope, spike all leafs, start with most hard to archive one. \nThat way can making me avoid wast time."
  }
}